# Тема 3. Операторы, условия, цыклы
Отчет по Теме #3 выполнил:
- Удовиченко Сергей Олегович
- ИНО ЗБ ПОАС 22-2

| Задание | Сам_раб |
| ------ | ------ |
| Задание 1 | + |
| Задание 2 | + |
| Задание 3 | + |
| Задание 4 | + |
| Задание 5 | + |

Работу проверили:
- к.э.н., доцент Панов М.А.
## Самостоятельная работы №3

### 1) Напишите программу, которая преобразует 1 в 31. Для выполнения поставленной задачи необходимо обязательно и только один раз использовать:
Цикл for
*= 5
+= 1
Никаких других действий или циклов использовать нельзя

```python
a = 1
for i in range(2):
  a *= 5
  a += 1
print(a)
```

### Результат:

### 2) Напишите программу, которая фразу «Hello World» выводит в обратном порядке, и каждая буква находится в одной строке консоли. 
При этом необходимо обязательно использовать любой цикл, а также программа должна занимать не более 3 строк в редакторе кода.

```python
text = "Hello World"
for i in text[::-1]:
  print(i)
```

### Результат:

### 3) Напишите программу, на вход которой поступает значение из консоли, оно должно быть числовым и в диапазоне от 0 до 10 включительно (это необходимо учесть в программе). Если вводимое число не подходит по требованиям, то необходимо вывести оповещение об этом в консоль и остановить программу. Код должен вычислять в каком диапазоне находится полученное число. Нужно учитывать три диапазона: от 0 до 3 включительно • от 3 до 6 • от 6 до 10 включительно Результатом работы программы будет выведенный в консоль диапазон. Программа должна занимать не более 10 строчек в редакторе кода.

```python
number = int(input())

if number < 0 or number > 10:
  print("Число не соответствует требованиям")
elif number <= 3:
  print("Число в диапазоне от 0 до 3")
elif number <= 6 and number > 3:
  print("Число в диапазоне от 3 до 6")
elif number <=10 and number > 6:
  print("Число в диапазоне от 6 до 10")
```

### Результат:

### 4) Манипулирование строками. Напишите программу на Python, которая принимает предложение (на английском) в качестве входных данных от пользователя. Выполните следующие операции и отобразите результаты: • Выведите длину предложения. • Переведите предложение в нижний регистр. • Подсчитайте количество гласных (a, e, i, o, u) в предложении. • Замените все слова "ugly" на "beauty". • Проверьте, начинается ли предложение с "The" и заканчивается ли на "end"

```python
def adqq(text):
  print(f"Длина предложения: {len(text)}\n")

  lower_case_text = text.lower()
  print(f"Предложение в нижнем регистре: {lower_case_text}\n")

  vowels = "aeiou"
  vowels_sum = sum(1 for i in text if i in vowels)
  print(f"Количество гласных: {vowels_sum}\n")

  print("Замена значений: " + text.replace("ugly", "beauty") + "\n")

  if text.startswith("The"):
    print("Предложение начинается с The \n")
  else:
    print("Предложение не начинается с The \n")

  if text.endswith("end"):
    print("Предложение заканчивается с end \n")
  else:
    print("Предложение не заканчивается с end \n")

  return ""


print(adqq(input()))
```

### Результат:

### 5) Составьте программу, результатом которой будет данный вывод в консоль:

```python
counter = 0
values = [0, 2, 4, 6, 8, 10]
string = "hello"
memory = " world"

while counter != 10:
  if counter in values:
    print(string + memory)
  else:
    print(string)
  counter += 1
string = string + " world"
memory = string
print(memory)
```

### Результат:
