# Тема 4. Функции и модули
Отчет по Теме #4 выполнил:
- Удовиченко Сергей Олегович
- ИНО ЗБ ПОАС 22-2

| Задание | Сам_раб |
| ------ | ------ |
| Задание 1 | + |
| Задание 2 | + |
| Задание 3 | + |
| Задание 4 | + |
| Задание 5 | + |

Работу проверили:
- к.э.н., доцент Панов М.А.
## Самостоятельная работы №4

### 1)

```python
from datetime import datetime # импорт библиотеки для работы со временем

from math import sqrt # Метод возведения в квадрат

def main(**kwargs): #  функция main с произвольным количеством элементов
  for key in kwargs.items(): # Получение значение элемента
    result = sqrt(key[1][0] ** 2 + key[1][1] ** 2) # Возводим 1 и 2 элемент массива в квадрат и складываем их
    print(result) # Вывод переменной result

if __name__ == '__main__': # Если вызов метода происходит в нем, а не импортируется в другом проекте
  start_time = datetime.now() # время сейчас
  main(                      # формирование словаря
      one=[10, 3],
      two=[5, 4],
      three=[15, 13],
      four=[93, 53],
      five=[133, 15]
      ) 
  time_costs = datetime.now() - start_time # Получаем время выполнения программы

  print(f"Время выполнения программы - {time_costs}") # Вывод переменной time_costs

```

### 2) Напишите программу, которая будет заменять игральную кость с 6 гранями. Если значение равно 5 или 6, то в консоль выводится «Вы победили», если значения 3 или 4, то вы рекурсивно должны вызвать эту же функцию, если значение 1 или 2, то в консоль выводится «Вы проиграли». При этом каждый вызов функции необходимо выводить в консоль значение “кубика”. Для выполнения задания необходимо использовать стандартную библиотеку random. Программу нужно написать, используя одну функцию и “точку входа”

```python
import random


def d6():
    roll = random.randint(1, 6)
    print(roll)

    if roll == 5 or roll == 6:
        print("Вы победили")
    elif roll == 3 or roll == 4:
        d6()
    else:
        print("Вы приграли")
d6()

```
### Результат:

### 3) Напишите программу, которая будет выводить текущее время, с точностью до секунд на протяжении 5 секунд. Программу нужно написать с использованием цикла. Подсказка: необходимо использовать модуль datetime и time, а также вам необходимо как-то “усыплять” программу на 1 секунду.

```python
from datetime import datetime
import time

for _ in range(5):
  print(datetime.now().strftime("%Y-%m-%d %H:%M:%S"))
  time.sleep(1)
```
### Результат:

### 4) Напишите программу, которая считает среднее арифметическое от аргументов вызываемое функции, с условием того, что изначальное количество этих аргументов неизвестно. Программу необходимо реализовать используя одну функцию и “точку входа”.

```python
def fun(*number):
  return sum(number) / len(number)
print(fun(1,2,3,4))
```
### Результат:

### 5) Создайте два Python файла, в одном будет выполняться вычисление площади треугольника при помощи формулы Герона (необходимо реализовать через функцию), а во втором будет происходить взаимодействие с пользователем (получение всей необходимой информации и вывод результатов). Напишите эту программу и выведите в консоль полученную площадь.

```python
import math

def traingle(a, b, c):
  p = (a + b + c) / 2
  s = math.sqrt(p * (p-a) * (p - b) * (p - c))
  return s

def ast_user():
  a = float(input('Введите длину первой стороны: '))
  b = float(input('Введите длину второй стороны: '))
  c = float(input('Введите длину третьей стороны: '))

  asdqq = traingle(a, b, c)

  print(f"Площадь треугольника {asdqq:.2f}")

ast_user()
```
### Результат:
